{"skillArea":"RDI Tools & Tech","name":"Benefits and HR policies benchmarking","skillDescription":"Ability to compare benefits and HR policy practices between and within organizations, sectors, industries, roles, practices and geographies.","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"Club/Custom Survey","skillDescription":"Understanding of custom analyses that look at market trends and compare and contrast that with each client’s unique situation, providing insights that will help compensation and HR professionals make rewards decisions that support their organizations’ business goals while remaining market competitive.","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"Compensation Software","skillDescription":"Understanding of WTW proprietary software that enables organizations to efficiently develop and manage their compensation programs through an intuitive, fully integrated experience; includes survey data, job leveling, competitive market assessment, program design, analytics and reporting.","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"Global/Regional Data Agreement","skillDescription":"Knowledge of RDI's Global Data Agreement (GDA) processes and procedures as included in the GDA Program.","_type":"rdiSkills"}
{"skillArea":"Data Analysis & Insights","name":"Advanced Excel / PowerPoint","skillDescription":"Microsoft Excel and Powerpoint are key tools used across the Practice for analysing data and presenting to clients and internal audiences.","_type":"rdiSkills"}
{"skillArea":"Data Analysis & Insights","name":"Data Challenge Methodology","skillDescription":"Learn the Data Challenge methodology enabling you to take new insights on your clients data to support new opportunity development","_type":"rdiSkills"}
{"skillArea":"Data Analysis & Insights","name":"Descriptive Statistics / Data","skillDescription":"Descriptive statistics are brief informational coefficients that summarize a given data set, which can be either a representation of the entire population or a sample of a population.explores the process of preparing and presenting sample data using graphical methods and then making valid inferences about the population represented by the sample.","_type":"rdiSkills"}
{"skillArea":"Data Analysis & Insights","name":"Excel / PowerPoint","skillDescription":"Microsoft Excel and Powerpoint are key tools used across the Practice for analysing data and presenting to clients and internal audiences.","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"CRM","skillDescription":"How to create and manage a sales pipeline using Microsoft Dynamics","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"Data Interactive (RDI)","skillDescription":"Understanding of WTW proprietary software that enables organizations to efficiently develop and manage their compensation programs through an intuitive, fully integrated experience; includes survey data, job leveling, competitive market assessment, program design, analytics and reporting.","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"Data Privacy and Information Security (RDI)","skillDescription":"The principles of data privacy and information security to ensure client data is managed appropriately and contracted accordingly","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"Financial Management","skillDescription":"The fundamentals of a WTW profit and loss report and how we genertae revenue","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"RDI Products","skillDescription":"Understanding and awareness of RDI's products and services, and the ability to explain and present to clients and prospects in order to increase participation and sales.","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"RDI’s Standard Operating Procedures","skillDescription":"Understanding of RDI's Standard Operating Procedures and apply appropriately.","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"Sales tracking","skillDescription":"How we track sales and manage our sales pipeline","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"SPM","skillDescription":"Understanding of RDI's internal tool SPM, awareness of each individual's task and responsabilities and apply appropriately.","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"Survey Methodology (RDI)","skillDescription":"Understanding of RDI's survey methodology and the ability to explain to data providers/participating companies in order to increase the quality of data submissions.","_type":"rdiSkills"}
{"skillArea":"RDI Tools & Tech","name":"Working with Growth Operations","skillDescription":"Understand the services available and how to request help fromn the Growth operations team in Manila","_type":"rdiSkills"}
{"skillArea":"Other","name":"Account Acquisition","skillDescription":"The process of getting new customers or convincing people to buy your products or services","_type":"rdiSkills"}
{"skillArea":"Other","name":"Account Development","skillDescription":"How to build and maintain client relationships","_type":"rdiSkills"}
{"skillArea":"Other","name":"Account Planning","skillDescription":"Account planning is the process of mapping out important details about a new prospect or existing client, including information about their decision-making process, competitor companies and the overall strategy to win, retain and grow revenue from the account","_type":"rdiSkills"}
{"skillArea":"Other","name":"Attention to Detail","skillDescription":"Ability to pay attention to things that matter.","_type":"rdiSkills"}
{"skillArea":"Other","name":"Building a Business Case","skillDescription":"How to highlight critical points of a plan and add depth of analysis in order to show how signifivant the case is. Includes how to present a business case to decision makers.","_type":"rdiSkills"}
{"skillArea":"Other","name":"Challenger Selling","skillDescription":"The Challenger Sale is a seller approach that stresses how clients can better manage their businesses and features a message tailored to clients specific needs and objectives.","_type":"rdiSkills"}
{"skillArea":"Other","name":"Communicating effectively","skillDescription":"The ability to communicate clearly and effectively in all forms, including verbal, written, and nonverbal.","_type":"rdiSkills"}
{"skillArea":"Other","name":"Competitor Knowledge","skillDescription":"Understanding our competitor's business strategy, including methodology, clients, fee structure and product offering in order to position our offering against the market.","_type":"rdiSkills"}
{"skillArea":"Other","name":"Consulting Skills","skillDescription":"Consulting skills are the mix of competencies that consultants use to create solutions for their clients. They include analytical skills, critical thinking, collaboration, creative thinking, communication, negotiation, and persuasion","_type":"rdiSkills"}
{"skillArea":"Other","name":"Contracting","skillDescription":"Understanding of how RDI contracts with clients large and small","_type":"rdiSkills"}
{"skillArea":"Other","name":"Customer Knowledge","skillDescription":"Understanding a company's compensation and benefits strategy and how that influences their need for RDI compensation and other data or products.","_type":"rdiSkills"}
{"skillArea":"Other","name":"Fundamentals of Rewards","skillDescription":"Understanding a company's business strategy and how that influences the way in which employees are rewarded is fundamental to career in the W&R practice.","_type":"rdiSkills"}
{"skillArea":"Other","name":"Negotiation & Influence","skillDescription":"Ability to positively influence and persuade client's decision makers in order to make satisfactory deals.","_type":"rdiSkills"}
{"skillArea":"Other","name":"Presentation Skills","skillDescription":"Include advanced techniques for creating and delivering memorable presentations.","_type":"rdiSkills"}
{"skillArea":"Other","name":"Project Management","skillDescription":"Methods and techniques to bring projects efficiently across the finish line on budget, on time, and within scope.","_type":"rdiSkills"}
{"skillArea":"Other","name":"Prospecting","skillDescription":"How to identify and pursue prospect organisations and contacts with a view to acquiring new clients","_type":"rdiSkills"}
{"skillArea":"Other","name":"Sales / Negotiation skills","skillDescription":"How to present RDI products and services in the context of client needs","_type":"rdiSkills"}
{"skillArea":"Other","name":"Strategic Sales planning","skillDescription":"How to develop a long term sales plan to generate revenue from identified segments and markets","_type":"rdiSkills"}
