{"name":"Articulating the Vision","ldOptions":[{"name":"Articulating the Vision","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Articulating-the-Vision.pdf"}],"definition":"Communicates a convincing and compelling vision for the company’s future that motivates others to action taking into account differences in markets, clients and talent for WTW. Provides strategic direction. Leads by example.","whatThisMeanForWr":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You compellingly explain W&R's vision, strategy and priorities and generate excitement in others about the future of our business"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You lead by example by reaching across practices and businesses to demonstrate the power of One WTW in your client work"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You bring the W&R value proposition to life in the market by engaging clients across the full W&R portfolio"}]}],"developing":[],"supporting":[],"applying":[],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Communicates the business unit’s vision for the future and motivates others by clearly describing the team’s role in supporting the vision."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Translates the business unit’s vision into clear, specific and achievable business unit objectives."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates enthusiasm and personal commitment to the business unit’s vision and future and engages other leaders to do the same. Leads by example."}]}],"shaping":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Articulates the business unit’s vision for the future and strategic direction in a compelling way that motivates others to take action to achieve goals."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Translates the organization’s vision into clear, specific and achievable business unit objectives."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Conveys and generates enthusiasm for and commitment to the business unit’s vision; identifies opportunities for others to demonstrate personal commitment to the strategic direction."}]}],"inspiring":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Articulates the organization’s vision for the future and strategic direction in a compelling and motivating way to all stakeholders, generating support, effectively managing resistance and creating a call to action."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Translates the overall vision into clear, specific and achievable long-term objectives for the organization."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Nurtures and promotes a culture where individuals are motivated and committed to the vision and recognized for their contribution."}]}],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"ce06c94a-f68f-49a3-b940-bb009f4e8e0e"}}
{"name":"Inclusive Leadership","ldOptions":[{"name":"Learning and Leadership Development","link":"https://willistowerswatson.service-now.com/servicecentral?id=kb_article_view&amp;sysparm_article=KB0013305&amp;sys_kb_id=961f4848876bd5184283b8cd8bbb3522&amp;spa=1"},{"name":"Inclusive Leadership","link":"https://willistowerswatson.percipio.com/search?q=inclusive%20leadership"}],"definition":"Takes responsibility for fostering an environment in which all colleagues are valued and heard. Regularly seeks and incorporates different perspectives in decision making. Builds inclusive and diverse teams. Provides encouragement and inspiration to help others succeed.","whatThisMeanForWr":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You strive to bring colleagues of diverse backgrounds, experiences and perspective together on teams"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You foster an inclusive work environment where people can feel confident being themselves"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You mentor and coach diverse colleagues to help prepare and connect them to new opportunities"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You push for inclusive hiring processes that will attract diverse candidates"}]}],"developing":[],"supporting":[],"applying":[],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Recognizes and mitigates own biases and cultural preferences. Acts as a role model for building teams that represent a broad range of diverse perspectives. Ensures that everyone speaks up and is heard."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Provides direction to multiple teams and manages resourcing for the business unit effectively; quickly takes control in new situations and coordinates a range of groups effectively; flexes style to be effective across audiences and cultural contexts."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Encourages and inspires staff to achieve business unit objectives by providing support and guidance; motivates teams to achieve performance goals."}]}],"shaping":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Values and seeks out diverse perspectives to inform decisions and empowers team to make decisions. Builds, develops and leverages diverse teams in business unit. Shares credit for business unit and team success."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Leads the business area effectively by coordinating how people and resources are best utilized to achieve success; takes the lead on key initiatives."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Inspires colleagues across the business unit to perform at their best; encourages others to recognize their contributions toward the success of the business unit and stay motivated."}]}],"inspiring":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Builds, develops and leverages diverse teams through all levels of the organization. Role models inclusive behaviors. Executes individual and team I&D goals."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Provides clear direction on organizational objectives and steers senior leadership to achieve them; effectively manages organizational resources."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates inspirational leadership and instills a high level of organizational commitment; motivates business leaders to focus on the things that matter for success."}]}],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"ce06c94a-f68f-49a3-b940-bb009f4e8e0e"}}
{"name":"Focusing on Clients","ldOptions":[{"name":"Focusing on Customers","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Focusing-on-Customers.pdf"}],"definition":"Understands and anticipates clients’ needs, builds relationships and provides insights and leading- edge solutions/services to exceed expectations as a trusted partner.","whatThisMeanForWr":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You bring solutions that meet the client’s specific needs, leveraging W&R’s latest point of view, intellectual capital, data and industry expertise"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You ask questions and build relationships to better understand clients’ needs and implications of our work"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You approach your work holistically to bring together Work & Rewards perspectives and solutions"}]}],"developing":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Identifies individual client needs by listening to and taking note of direct requests."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Develops straightforward solutions, based on past experience, to address client needs."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates insightfulness about client issues and looks at different ways to approach the improvements."}]}],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Identifies explicit and implied client needs by asking probing questions and understanding requirements."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Develops solutions that address client inefficiencies and improve the overall client experience."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Identifies client areas for improvement uses understanding of client to suggest enhancements."}]}],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Anticipates short-term client needs and identifies client preference trends/patterns."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Creates tailored client solutions for complex service offerings to provide exceptional experiences to clients."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Gets to the core of client issues quickly; identifies a number of ways to improve things and trusts own judgement and leverages past experiences to predict which methods will work best."}]}],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Anticipates prospective client needs based on interpretation of data regarding client preference trends/patterns."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Develops new and leading-edge solutions that meet current and future client needs."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Provides insights, identifies key issues and opportunities for improvement; demonstrates clear understanding of whether a proposed solution will be effective."}]}],"shaping":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Predicts broad needs across client groups, e.g., across segment/function and/or geography based on industry and economic trends."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Develops cross-business, innovative solutions in collaboration with segment/function and/or geography leadership to address emerging client needs."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Serves as a subject matter expert by providing breakthrough insights on critical client issues by identifying common themes; uses well-honed experience to determine which methods will be most effective."}]}],"inspiring":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Gains understanding all of the options available to clients and tracking key client experiences as they interact across the organization."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Leads development of enterprise-wide client solutions and to encourage others across the organization to develop new solutions."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates clear judgement for what needs to be improved to achieve the maximum benefit for the organization; demonstrates a clear sense of how to tackle improvements."}]}],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"0c89b331-73e4-4ceb-830a-52311ed440e4"}}
{"name":"Working in Teams","ldOptions":[{"name":"Effective Teamwork","link":"https://willistowerswatson.percipio.com/search?q=effective%20teamwork"},{"name":"Building Effective Teams","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Building-Effective-Teams.pdf"}],"definition":"Works effectively and inclusively within and across teams by seeking and valuing different points of view, ensuring all team members are heard and giving actionable feedback and recognition.","whatThisMeanForWr":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You solicit input from all members and levels of the internal teams"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You provide continuous, real-time feedback to colleagues"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You seek to build internal teams with colleagues across markets and practices and broaden your internal network"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You constructively challenge and debate topics with internal team to ensure that best solution is brought to the client"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You participate in internal initiatives to grow your network and skills"}]}],"developing":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Works respectfully with team members; consults more senior members of the team when required on decisions."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Values opportunities to work with colleagues with different backgrounds and experiences."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates an understanding of bias and own biases (conscious and unconscious)."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates awareness of various internal networks that have an impact on own work."}]}],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Works respectfully with team members on multiple projects and learns from others; encourages others to get involved and contribute to decisions."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Engages with the whole team and seeks/takes advantage of diverse thinking to deliver better solutions."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates awareness of inclusion and diversity concepts and the benefits of a diverse workforce."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Understands own team hierarchy and develops internal relationships to improve client outcomes and to develop professionally."}]}],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Works easily within and across teams, encourages learning; ensures that all relevant parties are included in key team project tasks and decisions. Shares opportunities and doesn’t repeatedly go to the same people."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Values and advocates for differences on the team, communicates the positive effects of incorporating a variety of backgrounds and perspectives; serves as a champion for inclusion."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates understanding of team structure and dynamics, and identifies key relationships outside of the practice to develop for the benefit of the team."}]}],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Builds effective and cross- functional teams on projects, promoting co-learning; ensures that all team members are heard when making important decisions."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Addresses non-inclusive and/or disrespectful behavior with direct feedback."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Actively seeks differences and varying perspectives within and across the business/function, serving as a role model for inclusivity; leverages diverse colleagues within and across teams to improve team performance."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Builds strong relationships and networks internally within and across the business/function and can navigate across the organization."}]}],"shaping":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Collaborates constructively with people at all levels across the organization; consults and involves the right people on topics/projects and cross-business decisions."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Builds diverse teams and promotes inclusion to achieve objectives; leverages team and company diversity to deliver innovation and thought leadership."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Connects others and guides them in understanding and navigating internal networks and political relationships across the organization to drive cross- business success."}]}],"inspiring":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Facilitates effective collaboration when views are “at odds” by focusing on shared goals that benefit the enterprise; ensures that the appropriate stakeholders are involved in critical organizational decisions."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Inspires and fosters a culture that values and respects diversity, using story-telling to convey the benefits of I&D, integrating diverse teams and perspectives across the organization."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Strategically navigates the internal political landscape and breaks down silos within the organization to enable development of cross-organizational networks."}]}],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"0c89b331-73e4-4ceb-830a-52311ed440e4"}}
{"name":"Driving for Excellence","ldOptions":[{"name":"Operational Excellence","link":"https://willistowerswatson.percipio.com/channels/13c544a0-f91a-11e6-aad2-6b3c03be7fe8?tab=WATCH"}],"definition":"Strives for excellence and continuous improvement. Seeks out new learning opportunities and invites feedback on own performance.","whatThisMeanForWr":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You follow the WTW excellence practices to ensure quality deliverables and outputs"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You ask for feedback on your performance and apply learnings to future work"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You understand and ensure details are right, but you also make sure the work makes sense from a big picture perspective"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You look for ways to introduce and leverage digital solutions and tools in selling and project work to enhance the colleague and client experience"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You use W&R codified and standardized methodologies"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You leverage WTW data products to develop client solutions"}]}],"developing":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Takes advantage of opportunities for gaining new information, developing expertise and acquiring new skills relevant to own job."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Seeks out and responds appropriately to positive and constructive feedback."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Understands own capabilities and articulates development needs."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Recognizes areas of strength and where extra help is needed."}]}],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Seeks out and takes advantage of opportunities to learn and acquire new knowledge and skills; reads materials related to professional area and engages in activities aimed at increasing expertise."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Asks for positive and developmental feedback; acknowledges and acts on feedback."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Recognizes and understands own strengths, development areas and learning style/preferences."}]}],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Regularly seeks out new opportunities to develop expertise, recognizing the value and importance of development opportunities; acquires and assimilates new knowledge at a fast pace."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Routinely seeks feedback for continuous improvement related to own and team performance and uses constructive feedback for career development."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Assesses own strengths and development areas accurately and realistically; considers own learning style/preferences when identifying opportunities for growth."}]}],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Continuously develops expertise, using a variety of sources to acquire new knowledge and skills; ensures own specialist knowledge and that of the business/function is up-to- date, helps others reach their development goals."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Encourages others in the business/function to ask for and provide observations to other colleagues; proactively responds to personal feedback."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Challenges self and others within the business/function to be aware of development opportunities and learning styles/ preferences."}]}],"shaping":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Seeks new ways of learning to ensure own subject and role knowledge is current and that mechanisms are in place for disseminating new information across teams; serves as a subject matter expert and resource to others."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Proactively seeks and acts on feedback from other business leaders on team performance; role models open, constructive, forward- focused feedback discussions on a regular basis."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Openly reflects on own development, seeking continuous learning and inspires others across the business to critically reflect on their strengths and development areas."}]}],"inspiring":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Regularly scans the environment for new information to keep informed on trends and to remain a subject matter expert in own area; puts developing skills and expertise at the heart of the organization, helping colleagues access development opportunities to update their knowledge and skills."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Actively develops channels for effective feedback on performance across the organization; acts on feedback as an opportunity for improvement (e.g., staff engagement, service delivery, new products)."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Exemplifies self-awareness and acts as a model for others in setting clear development expectations, reflecting on strengths and learning styles. Tells “leadership story” as a way to engage colleagues in the normalcy of learning and un-learning."}]}],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"0c89b331-73e4-4ceb-830a-52311ed440e4"}}
{"name":"Fostering Innovation","ldOptions":[{"name":"Innovation Masters","link":"https://wtwonline.sharepoint.com/sites/Innovation/sitepages/innovation-masters.aspx"},{"name":"Innovation and Creativity","link":"https://willistowerswatson.percipio.com/search?q=creativity%20and%20innovation"},{"name":"Creating Innovation","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Creating-Innovation.pdf"}],"definition":"Generates well-formed ideas; understands how models, theories, research and new concepts relate to future objectives and develops effective, commercial strategies.","whatThisMeanForWr":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You apply the 80-20 rule, taking calculated risks and balancing speed and approach to prioritize the most impactful work"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You look for and share new ways to approach a project or issue"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You draw connections between seemingly unrelated projects or work to bring holistic and broader, integrated solutions, where appropriate"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You seek to understand theories, research and new solutions and bring those into client conversations"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You employ a digital mindset in developing solutions, identifying ways to bring digital solutions to clients"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You look for creative ways to use data in developing client solutions"}]}],"developing":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Produces some ideas and is open to new approaches relating to own work efficiency."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates an awareness of the theories and practices within own discipline."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Helps to ensure that new strategies are implemented appropriately in own work; develops understanding as to how current and emerging trends affect own role."}]}],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Proposes ideas and suggests new approaches to taking on own work tasks and issues in a better way."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Shows a good understanding of key theories and concepts in own discipline by identifying underlying principles."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Contributes to the formation of effective strategies that maximize own efficiency, keeping current on trends impacting immediate team."}]}],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Generates well-formed ideas that have the potential to provide effective alternative methods of working for self and the team."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Understands how models, theories, research and new concepts relate to the team’s future objectives and aims."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Develops effective new strategies for self and the team informed by longer-term organizational goals; anticipates emerging short-term trends that may impact own and team objectives."}]}],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Generates impactful ideas and new approaches to substantively address a range of work areas across business/function unit; encourages others to generate ideas. Willing to challenge others’ ideas and take risks / let others fail to learn."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Understands how models, theories, research and new concepts relate to the work of the business/function unit and applies principles appropriately."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Develops commercial strategies across the business unit that recognize the potential impact of challenges or opportunities on the group’s success; scans the external environment, paying attention to diverse viewpoints regularly to anticipate longer-term trends."}]}],"shaping":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Implements non- conventional ideas and approaches when developing solutions that have the potential to improve products and services delivered by the business unit. Creates an environment where calculated risks and respectful debate are encouraged."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Understands how models, theories, research and new concepts relate to the broader business unit and actively applies the principles."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Develops commercial strategies for the own business and related business units by examining future scenarios, opportunities and risks; Helps shape the organization’s vision of the future by incorporating diverse key stakeholder and external environment information."}]}],"inspiring":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates openness to innovation and adopting radical solutions; recognizes ideas which have real potential for the organization; inspires individuals at all levels of the organization to experiment and be creative."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Has a clear understanding of leading theories, research and conceptual models in the industry sector and uses them to create business models for future success."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Establishes new and highly commercial strategies based on an in-depth understanding of market and industry trends; sets a clear- sighted vision for the organization to ensure the business moves into the desired position in the market."}]}],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"0c89b331-73e4-4ceb-830a-52311ed440e4"}}
{"name":"Influencing Stakeholders","ldOptions":[{"name":"Influencing and Persuading Others","link":"https://willistowerswatson.percipio.com/courses/4b24d6ee-c958-11e7-8c81-9212ca48e307/videos/4b24d6ef-c958-11e7-8c81-9212ca48e307"}],"definition":"Builds relationships and takes account of the needs of multiple stakeholders to communicate, involve, influence and drive decisions for beneficial business outcomes.","whatThisMeanForWr":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You ask thought provoking questions to internal and external stakeholders to understand their motivations and drivers and to guide them towards optimal outcomes"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You maintain communication to keep the relationship active to build long-term connections"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You adapt communications and tone based on audience"}]}],"developing":[],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Understands who key stakeholders are within and across the team."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Begins to establish relationships with key stakeholders within own team."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Understands the basic role stakeholders play in the team’s ability to achieve optimal outcomes."}]}],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Builds an understanding of stakeholders' needs, drivers and constraints."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Develops relationships with peer stakeholders within and across teams by initiating regular contact."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Identifies mutual interests and interdependencies stakeholders share with the team."}]}],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Understands the needs, drivers and constraints of stakeholders and applies this knowledge to develop common understanding."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Maintains long-term, trusting relationships with stakeholders through ongoing communication and forums."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Recognizes business unit needs and identifies appropriate stakeholders to engage in decision making to ensure buy-in and desirable outcomes."}]}],"shaping":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Anticipates the potentially competing needs, drivers and constraints of various stakeholders to develop common understanding across widely diverse parties."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Maintains long-term relationships with key stakeholders who are critical to the business unit by creating formal and informal relationship-building opportunities."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Identifies cross-business unit interests and needs and engages appropriate stakeholders in important decisions to ensure buy-in and mutually beneficial outcomes."}]}],"inspiring":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Predicts and guides other leaders to understand various disparate stakeholder groups and their agendas to influence organizational decisions and ensure successful outcomes."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Drives and nurtures key relationships with internal and external stakeholders who are critical to the success of the organization, helping other leaders do the same."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Engages key internal and external stakeholder groups in critical decisions impacting the organization to ensure buy-in and optimal outcomes."}]}],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"0c89b331-73e4-4ceb-830a-52311ed440e4"}}
{"name":"Developing Talent","ldOptions":[{"name":"Developing Talent","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Developing-Talent.pdf"}],"definition":"Develops, coaches and mentors talent to improve performance. Connects day-to-day work experiences to professional development. Builds and develops diverse teams.","whatThisMeanForWr":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You encourage others to take on new challenges and support them in doing so"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You seek out diversity in backgrounds, experiences and perspectives in your working relationships and when building teams"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You develop yourself by taking advantage of internal and external learning offerings and relationships"}]}],"developing":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Stays alert to identify learning opportunities for self."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Willingly shares own knowledge and experience to support others' learning inclusively."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Shares constructive project- or deliverable- specific feedback with each team member when prompted."}]}],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Assists others in identifying realistic opportunities for personal growth."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Invests time and effort to informally coach more junior colleagues."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Proactively provides immediate and specific constructive feedback and recognition evenly across own team."}]}],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Shares learning and growth opportunities inclusively within team and encourages others to work outside of their comfort zone by taking on new assignments."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Finds opportunities to coach others, consciously including colleagues who are different, providing specific insights and tips to enhance skills, knowledge or work performance."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Proactively provides ongoing constructive, behaviorally-oriented feedback and recognition evenly within the team to increase future performance."}]}],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Leverages internal networks to connect talent within and across the business unit to development opportunities (e.g., stretch assignments, rotations, secondments), with the goal of developing high-performing, diverse teams."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Serves as a trusted coach or mentor within the business unit by sharing knowledge and offering personalized suggestions regarding growth and development, consciously including colleagues who are different from you."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Delivers both individual and group feedback and recognition evenly to support ongoing development and overall department performance."}]}],"shaping":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Shapes developmental roles and experiences with the goal of developing high-performing, diverse teams (e.g., stretch assignments, rotations, secondments) balancing individual and business unit needs."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Actively coaches and mentors within and outside business unit, to promote career acceleration, consciously including colleagues who are different from you."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Promotes and champions practices and channels across and outside the business unit to deliver consistent and constructive behaviorally-oriented performance feedback and recognition evenly."}]}],"inspiring":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Encourages, promotes and sponsors development opportunities and experiences for colleagues with diverse backgrounds to safeguard WTW future competitive advantage."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Supports and champions programs that reward individuals for sharing organizational knowledge and coaching/mentoring others to maximize capability, inclusion and diversity across the organization."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Drives a feedback-oriented culture and holds self and others accountable providing ongoing, constructive feedback and recognition evenly, to accelerate career development and organizational performance."}]}],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"0c89b331-73e4-4ceb-830a-52311ed440e4"}}
{"name":"Adapting to Change","ldOptions":[{"name":"Change Leadership","link":"https://willistowerswatson.service-now.com/servicecentral?id=kb_article_view&amp;sysparm_article=KB0013312&amp;sys_kb_id=9282740a47a49d98be7b3b42846d43b1&amp;spa=1"},{"name":"Adapting to Change","link":"https://willistowerswatson.percipio.com/channels/06720340-e71a-11e6-9835-f723b46a2688?tab=WATCH"},{"name":"Adjusting to Change","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Adjusting-to-Change.pdf"}],"definition":"Operates with a growth mindset. Takes a positive approach and maintains focus on delivering results. Invites and uses feedback related to performance constructively with a learning orientation.","whatThisMeanForWr":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You recognize that change is a part of business and strive to understand the reasons and implications in order to adapt"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You have a positive attitude and show resilience even when facing setbacks and challenges"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You adapt quickly and can change direction when needed to continue delivering results"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You embrace ambiguity to tackle challenges and stretch outside of your comfort zone"}]}],"developing":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates a positive attitude; recovers well from setbacks."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Copes with change and new challenges relating to own work tasks; shows tolerance for uncertainty/ambiguity and escalates to manager when clarity is required."}]}],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Takes an optimistic approach to tackling work; identifies the positives in every opportunity and challenge."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Copes well with change, recognizes it as feature of the modern world; demonstrates comfort when working with limited information and quickly adapts to challenges, making the most of the situation."}]}],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Is optimistic about what the team can achieve together; emphasizes positives to help other team members to move on and accept the unknown."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Understands the need for change, comfortable with ambiguous and uncertain situations; easily adapts to changing circumstances or demands, and helps others on the team to understand."}]}],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Is optimistic about what the business unit can achieve; encourages and steers the team to learn and move on quickly from setbacks."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Embraces change and quickly alters course in response to new challenges; leads the business unit successfully through change by helping others understand the reasons and positive impacts, focusing them on what is known rather than unknown."}]}],"shaping":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Maintains optimism when faced with significant challenges within the business unit; deals well with and learns from setbacks, helping other leaders and groups to remain positive."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Leads change and takes on new challenges to move the business forward; understands that resistance is an natural response to change and supports leaders with the effective management of change."}]}],"inspiring":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates unwavering optimism in the future success of the organization; boosts morale when the organization is faced with setbacks or difficulties."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Drives new business initiatives, inspiring the organization to view change beneficial and minimizing the impact of uncertainty; thrives in response to major new challenges and translates these into opportunities that provide real benefit for the organization."}]}],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"0c89b331-73e4-4ceb-830a-52311ed440e4"}}
{"name":"Business Acumen","ldOptions":[{"name":"Demonstrating Business Acumen","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Demonstrating-Business-Acumen.pdf"}],"definition":"Maintains an understanding of business, financial and industry concepts and trends to effectively engage clients, inform commercial solutions and understand impact to our own business","whatThisMeanForWr":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You suggest ideas and solutions that take account of your client’s business model and value chain"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You understand how your work impacts W&R's bottom line, including structuring budgets to leverage resources properly and achieve an optimal net operating income (NOI)"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You research and ask questions to understand what the client does and how our work could impact their financials or business"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You may contribute to a W&R industry team or build industry expertise by taking note of industry trends and dynamics and bring related information to relevant proposals, projects and clients"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You maintain awareness of the global economy and how global trends (social, political and economic) impact the business"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You understand the relevance of the regulatory environment impacting W&R products and solutions and our clients"}]}],"developing":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Builds an understanding of the client’s business model; develops industry awareness."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates a basic understanding of how the W&R business makes money and business basics such as time recording, billing and collections."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Executes tasks and work based on structured processes to achieve pre-defined client objectives."}]}],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates an understanding of the essential functions and metrics of a client’s business; deepens industry knowledge."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates an understanding of the financial measures of success for W&R and how this relates to own role."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Recommends and executes ways to adapt process or approach based on the client’s business and industry."}]}],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Stays up to date on the client’s business and financial performance and environment; builds industry expertise and adapts WTW insights and IC to specific industry context."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Acts based on understanding of the direct impact the individual’s client work and actions has on W&R’s financial success (e.g., understands NOI, tracks project budget)."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Adapts the design and implementation of strategies and programs to align to the client’s business and financial goals and industry."}]}],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Builds deep knowledge of client’s business model, operations and financial metrics; integrates industry perspective into client solutions."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Makes project decisions and financial (e.g., budget) recommendations utilizing strong understanding of W&R’s business levers to improve financial and other outcomes."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Leads internal team to set approach and strategy based on the client’s unique business model and differentiators; leverages collective WTW industry expertise and insights to inform strategy and approach."}]}],"shaping":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Demonstrates and shares in-depth understanding of the client’s business model and operations, as well as industry context, to enable internal project team’s understanding and knowledge."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Employs knowledge of W&R business to make critical decisions that support the organization’s financial goals, and encourages others to do the same."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Drives direction of approach and strategy based on client’s business and financial goals and WTW industry expertise and insights; challenges orthodox ways of working to benefit client."}]}],"inspiring":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Proactively works to ensure a shared understanding of client’s business model and industry context within broader practice and business teams."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Applies and explains the levers that can be adjusted to result in favorable financial outcomes for W&R, making trade-offs between competing priorities."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Advises on how to anchor client work strategies based on industry and organization expertise and insights."}]}],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"ade71a1f-e7f0-47c0-a4c2-823f08f079e5"}}
{"name":"Sales Mindset","ldOptions":[{"name":"Sales Mindset (coming soon!)","link":null}],"definition":"Cultivates and broadens relationships with clients, exemplifying the W&R value proposition, to identify and create sales opportunities and fulfill sales enablement activities","whatThisMeanForWr":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You promote the W&R value proposition through sales activities and client / prospect interactions"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You partner with other businesses and bring in relevant SMEs to identify and pursue opportunities and collaborate on proposals"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You proactively approach clients with new solutions"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You ask broad questions and listen for cues that indicate the client may benefit from a WTW offering and identify a potential new buyer"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You are aware of W&R research and marketing campaigns that are relevant to the market and can open doors to new work with current and potential clients"}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"You participate in level-appropriate sales training and enablement sessions"}]}],"developing":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Participates in client meetings, understanding key client players and their roles and builds relationships internally with a wide range of colleagues to understand sales process."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Provides support to project, account and/or sales teams on the completion of sales enablement tasks and continually seeks opportunities to enhance effectiveness."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Supports development of case studies and materials to demonstrate the W&R value proposition and its unique differentiation based on internal and external feedback."}]}],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Creates strong relationships internally to broaden expertise across multiple solution areas; begins to create relationships with key client contacts and participates in sales activities."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Owns the tracking of sales enablement activities for project, account and/or sales teams, including timely updates in CIS/MS Dynamics and client/prospect follow-up."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Exemplifies the W&R value proposition and relevant W&R products, services and solutions to clients through case studies, proposals and presentations."}]}],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Invests in proactively growing internal and client networks to identify and pursue sales opportunities, leveraging trusted colleague and client relationships."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Supports the development of and guides the tracking of sales enablement activities for project, account and/or sales teams, including timely updates on CIS/MS Dynamics and client/prospect follow-up."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Promotes the W&R value proposition and identifies relevant W&R and HWC products, services and solutions that will most benefit the client and support a continued partnership."}]}],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Strengthens relationships internally and externally by staying in touch with contacts within and outside of project work, continuously pursuing opportunities to take existing work one step further with a new WTW solution or team."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Takes accountability for ensuring sales enablement activities are completed by self or team member(s) on a timely basis, including pipeline management, timely updates on CIS/MS Dynamics and client/prospect follow-up."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Leads promotion of the W&R value proposition and identifies unique W&R and relevant HWC product, service and solution bundles that differentiate us from competitors and generates new opportunities."}]}],"shaping":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Creates and broadens relationships with clients and colleagues to build connections across HWC and WTW businesses and potential buyers; acts as trusted advisor to clients and sales coach to other colleagues, shaping strategic sales efforts and solutions."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Role models and proactively coaches colleagues on the value of discipline in fulfilling sales enablement activities, reinforcing the importance of the sales enablement activities with junior colleagues."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Develops the strategy to meet long-term needs of the client, aiming for the relationship to be viewed by the client as indispensable and irreplaceable."}]}],"inspiring":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Role models trusted advisor and networking behaviors and bringing together businesses within HWC and WTW to create holistic solutions and lead complex integrated sales efforts; proactively mentors and coaches other colleagues to demonstrate the same behaviors."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Continuously innovates and evolves overall approach to sales enablement and how we approach sales in the market, driving change with colleagues at all levels."}]},{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Advises on direction for strategy and provides deep expertise that demonstrates the value of continued partnership to meet long-term client needs."}]}],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"ade71a1f-e7f0-47c0-a4c2-823f08f079e5"}}
{"name":"Resource Planning & Optimization","ldOptions":[{"name":"Managing Project Resources","link":"https://willistowerswatson.percipio.com/courses/3e44bbe9-52b6-4c85-9d30-da015cb6da88/videos/594d066b-3865-4feb-8e4e-c9e41f34072c"}],"definition":"Plans and optimizes resources within teams in order to maximize results and achieve desired performance.","whatThisMeanForWr":[],"developing":[],"supporting":[],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Reviews the skill and expertise requirements to accomplish team goals and identifies staffing and talent resources to fill project roles; Develops action plans for optimal resource utilization and manages financial/material resource usage among team; Encourages others to assess the potential impact of resource decisions related to efficiency and cost reduction."}]}],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Reviews skill and expertise requirements across the department or multiple teams and ensures that enough people are trained or cross-trained to achieve work goals; Creates contingency resource plans to ensure continuity of work processes in the face of a delay or shortage in financial/material resources; Recognizes and rewards appropriate resource utilization and creative suggestions to gain efficiency in resource usage."}]}],"shaping":[],"inspiring":[],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"d8b20295-8343-4db9-8912-214d270cfa63"}}
{"name":"Demonstrating a global mindset","ldOptions":[{"name":"Demonstrating Global Mindset","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Demonstrating-Global-Mindset.pdf"}],"definition":"Promotes the value of individual differences and cultural diversity to create an open, respectful and inclusive workplace, both locally and globally.","whatThisMeanForWr":[],"developing":[],"supporting":[],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Encourages others to share diverse cultural perspectives, processes and norms to build awareness across the team; appreciates and adapts to different cultural settings or environments; Supports and promotes differences within the team, communicating the positive effects of integrating a variety of backgrounds and perspectives; serves as an advocate for inclusion; Understands how local team contributes to global business objectives and creates local plan for team to achieve those objectives."}]}],"leading":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Encourages others to share diverse cultural perspectives, processes and norms to build awareness across the team; appreciates and adapts to different cultural settings or environments; Supports and promotes differences within the team, communicating the positive effects of integrating a variety of backgrounds and perspectives; serves as an advocate for inclusion; Understands how local team contributes to global business objectives and creates local plan for team to achieve those objectives."}]}],"shaping":[],"inspiring":[],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"d8b20295-8343-4db9-8912-214d270cfa63"}}
{"name":"Structuring Tasks","ldOptions":[{"name":"Structuring Tasks","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Structuring-Tasks.pdf"}],"definition":"Plans work and sets clear priorities; upholds ethical standards and fulfills commitments while maintaining high levels of work output.","whatThisMeanForWr":[],"developing":[],"supporting":[],"applying":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Makes detailed project plans, setting clear team priorities linked to short-term organizational goals; Demonstrates strong ethical behavior, consistently fulfilling commitments to others; maintains confidentiality within the team and beyond; Maintains high levels of productivity and output for self and team."}]}],"leading":[],"shaping":[],"inspiring":[],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"d8b20295-8343-4db9-8912-214d270cfa63"}}
{"name":"Representing the organisation","ldOptions":[{"name":"Representing the Organisation","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Representing-the-Organization.pdf"}],"definition":"Functions as the public persona and promotes a positive image of the organization to the external environment.","whatThisMeanForWr":[],"developing":[],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Integrates organizational professional standards in all aspects of work and understands the connection to the broader community's view of the organization; Follows the business unit's established information sharing policies and escalation procedures when interacting with the media, general public or financial/analyst community; Attends community groups and events, contributing to a positive image of the organization within the community."}]}],"applying":[],"leading":[],"shaping":[],"inspiring":[],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"d8b20295-8343-4db9-8912-214d270cfa63"}}
{"name":"Building relationships","ldOptions":[{"name":"Buidling Relationships","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Building-Relationships.pdf"}],"definition":"Interacts well with others, quickly establishing rapport; gains recognition for achievements and accomplishments.","whatThisMeanForWr":[],"developing":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Interacts enthusiastically with others; makes contact with people as needed; Is welcoming to people and develops positive relationships within the team; Seeks recognition for own area of work; gains acknowledgement for personal achievements."}]}],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Interacts well with team members and others; communicates with enthusiasm; Puts people at ease and is welcoming; forms good relationships with team members; Shares own work achievements and is motivated by praise; gains recognition and acknowledgement within the team."}]}],"applying":[],"leading":[],"shaping":[],"inspiring":[],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"d8b20295-8343-4db9-8912-214d270cfa63"}}
{"name":"Managing Self Development","ldOptions":[{"name":"Self-Development","link":"https://willistowerswatson.percipio.com/channels/cc04b250-f918-11e6-aad2-6b3c03be7fe8?tab=WATCH"},{"name":"Managing Self Development","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Managing-Self-Development.pdf"}],"definition":"Actively learns through experimentation and experience and seeks ways to grow and to be challenged by new and novel conditions.","whatThisMeanForWr":[],"developing":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Recognizes own past contributions and failures, and asks others for suggestions on how to improve; Accepts suggestions for new ways of working that may require new skills or techniques; Understands own capabilities and articulates learning needs."}]}],"supporting":[{"_type":"block","style":"normal","markDefs":[],"children":[{"_type":"span","text":"Makes time to critically reflect on past experiences and failures, and considers ways to improve; Demonstrates the willingness to change perspectives and ideas that are no longer relevant and learn new skills or techniques; Recognizes and understands own strengths, development areas and learning style/preferences."}]}],"applying":[],"leading":[],"shaping":[],"inspiring":[],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"d8b20295-8343-4db9-8912-214d270cfa63"}}
{"name":"Giving Support","ldOptions":[{"name":"Giving Support","link":"https://wtwonline.sharepoint.com/sites/HR/Shared%20Documents/GPS-Giving-Support.pdf"}],"definition":"","whatThisMeanForWr":[],"developing":[],"supporting":[],"applying":[],"leading":[],"shaping":[],"inspiring":[],"_type":"competencies","businessSegment":{"_type":"businessSegment","_ref":"d8b20295-8343-4db9-8912-214d270cfa63"}}
